# X Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
XYZ..::..X Property
XYZ Class See Also
---
Gets the first coordinate.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double X { get; }
```

Visual Basic
---
```text
Public ReadOnly Property X As Double
	Get
```

Visual C++
---
```text
public:
property double X {
	double get ();
}
```

# See Also
XYZ Class
Autodesk.Revit.DB Namespace